In [1]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avacado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0]=None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
## Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data=pd.Series([1,NA,3.5,NA,7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data=pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned=data.dropna()

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all') # passing how=all will drop rows that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4]=NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1,how='all')#This will drop all the rows which have NA values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df=pd.DataFrame(np.random.randn(7,3))

In [23]:
df

          0         1         2
0 -0.049701  1.590777 -1.600343
1 -1.226379  2.106870  0.522730
2  1.815997 -0.639754  0.034073
3  0.958204  0.362556 -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [24]:
df.iloc[:4,1]=NA

In [25]:
df

          0         1         2
0 -0.049701       NaN -1.600343
1 -1.226379       NaN  0.522730
2  1.815997       NaN  0.034073
3  0.958204       NaN -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [26]:
df.iloc[:2,2]=NA

In [27]:
df

          0         1         2
0 -0.049701       NaN       NaN
1 -1.226379       NaN       NaN
2  1.815997       NaN  0.034073
3  0.958204       NaN -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [28]:
df.dropna()

          0         1         2
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [29]:
df.dropna(thresh=2)

          0         1         2
2  1.815997       NaN  0.034073
3  0.958204       NaN -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [30]:
## Filling in Missing Data

In [31]:
df.fillna(0)

          0         1         2
0 -0.049701  0.000000  0.000000
1 -1.226379  0.000000  0.000000
2  1.815997  0.000000  0.034073
3  0.958204  0.000000 -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [32]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.049701  0.500000  0.000000
1 -1.226379  0.500000  0.000000
2  1.815997  0.500000  0.034073
3  0.958204  0.500000 -0.434056
4  0.512092  0.240573  1.587834
5  0.197049 -0.295030  0.053991
6  0.059677  1.734946  0.393126

In [40]:
df=pd.DataFrame(np.random.randn(6,3))

In [41]:
df

          0         1         2
0  3.009979 -0.194711 -0.851870
1  0.153359 -1.088523 -0.671519
2 -0.843628 -0.852279  0.371380
3  0.476544  0.207294  0.581395
4  0.952461 -0.890975 -0.970142
5  0.374044  1.772852  0.518353

In [42]:
df.iloc[2:,1]=NA

In [43]:
df

          0         1         2
0  3.009979 -0.194711 -0.851870
1  0.153359 -1.088523 -0.671519
2 -0.843628       NaN  0.371380
3  0.476544       NaN  0.581395
4  0.952461       NaN -0.970142
5  0.374044       NaN  0.518353

In [44]:
df.iloc[4:,2]=NA

In [45]:
df

          0         1         2
0  3.009979 -0.194711 -0.851870
1  0.153359 -1.088523 -0.671519
2 -0.843628       NaN  0.371380
3  0.476544       NaN  0.581395
4  0.952461       NaN       NaN
5  0.374044       NaN       NaN

In [46]:
df.fillna(method='ffill')

          0         1         2
0  3.009979 -0.194711 -0.851870
1  0.153359 -1.088523 -0.671519
2 -0.843628 -1.088523  0.371380
3  0.476544 -1.088523  0.581395
4  0.952461 -1.088523  0.581395
5  0.374044 -1.088523  0.581395

In [47]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  3.009979 -0.194711 -0.851870
1  0.153359 -1.088523 -0.671519
2 -0.843628 -1.088523  0.371380
3  0.476544 -1.088523  0.581395
4  0.952461       NaN  0.581395
5  0.374044       NaN  0.581395

In [49]:
data=pd.Series([1,NA,3.5,NA,7])

In [50]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [51]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [52]:
## Data Transformation

In [53]:
# Removing Duplicates

In [54]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [55]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [58]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [59]:
data['v1']=range(7)

In [60]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [61]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [62]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [63]:
## Transforming Data using a Function or Mapping

In [64]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','bacon','pastrami','honey ham','nova lox'],'ounches':[4,3,12,6,7.5,8,3,5,6]})

In [65]:
data

          food  ounches
0        bacon      4.0
1  pulled pork      3.0
2        bacon     12.0
3     pastrami      6.0
4  corned beef      7.5
5        bacon      8.0
6     pastrami      3.0
7    honey ham      5.0
8     nova lox      6.0

In [66]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}

In [68]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [72]:
lowercased=data['food'].str.lower()

In [74]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [75]:
data['animal']=lowercased.map(meat_to_animal)

In [76]:
data

          food  ounches  animal
0        bacon      4.0     pig
1  pulled pork      3.0     pig
2        bacon     12.0     pig
3     pastrami      6.0     cow
4  corned beef      7.5     cow
5        bacon      8.0     pig
6     pastrami      3.0     cow
7    honey ham      5.0     pig
8     nova lox      6.0  salmon

In [77]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [78]:
# Replacing Values

In [79]:
data=pd.Series([1,-999,2,-999,-1000,3])

In [80]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [81]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [82]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [83]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [84]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [85]:
## Renaming Axis Indexes

In [86]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [87]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [88]:
transform=lambda x:x[:4].upper()

In [89]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [90]:
data.index=data.index.map(transform)

In [91]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [92]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [93]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [94]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [95]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [96]:
## Detecting and filetring Outliers

In [97]:
data=pd.DataFrame(np.random.randn(1000,4))

In [98]:
data

            0         1         2         3
0   -0.699763 -0.639120  0.611701 -0.530229
1   -0.384283 -0.018757  1.647577 -0.874142
2   -0.280941  0.870505 -0.118007  1.753039
3   -0.722196 -0.855160 -0.502142 -0.770836
4    1.336839 -0.342401  0.899134 -1.330917
..        ...       ...       ...       ...
995 -1.558065  1.618134  0.841041  0.572344
996 -1.799280  0.129183 -0.464497  0.374604
997  0.740490 -2.741795  0.627067 -0.165129
998 -0.189706 -0.618680 -0.405122  0.151964
999 -0.092040 -0.958298  0.990146 -0.182149

[1000 rows x 4 columns]

In [99]:
col=data[2]

In [100]:
col

0      0.611701
1      1.647577
2     -0.118007
3     -0.502142
4      0.899134
         ...
995    0.841041
996   -0.464497
997    0.627067
998   -0.405122
999    0.990146
Name: 2, Length: 1000, dtype: float64

In [101]:
col[np.abs(col)>3]

181   -3.352285
408   -3.294664
Name: 2, dtype: float64

In [102]:
data[(np.abs(data)>3).any(1)] # To select all rows having a value exceeding 3 or -3

            0         1         2         3
87  -1.025919  0.330923 -0.130414  3.086076
181  0.367251 -1.305103 -3.352285 -0.936719
300 -0.192267  3.427308  0.545876  0.719879
408  1.056339  0.749188 -3.294664 -1.013444
529  4.250221 -2.304718 -0.389496  0.976884
563  1.071232 -3.061314  0.523990 -1.487591
630 -3.659605 -0.839673 -0.043242  0.143947
689  3.028347 -0.501495 -1.469166 -1.104951
924  0.465189  0.090877  1.498613  3.007130

In [103]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.027153     0.036927     0.050624     0.026156
std       1.040432     0.988524     1.019583     0.987994
min      -3.659605    -3.061314    -3.352285    -2.672834
25%      -0.678790    -0.602618    -0.592532    -0.620041
50%       0.027257     0.045486     0.061357     0.014221
75%       0.715610     0.677444     0.746846     0.706296
max       4.250221     3.427308     2.913158     3.086076

In [104]:
## Permutation and Random Sampling